artillery.yml
config:
  target: 'http://localhost:3003'  # URL of the target system
  phases:
    - duration: 1     # Duration of the test in seconds
      arrivalRate: 1000  # Number of virtual users per second

scenarios:
  - name: "Get questions"
    flow:
      - get:
          url: "/qa/questions"
          qs:
            product_id: "{{ $randomNumber(1, 100) }}"
            page: "{{ $randomNumber(1, 10) }}"
            count: "{{ $randomNumber(1, 20) }}"

  - name: "Post question"
    flow:
      - post:
          url: "/qa/questions"
          qs:
            product_id: "{{ $randomNumber(1, 100) }}"
            page: "{{ $randomNumber(1, 10) }}"
            count: "{{ $randomNumber(1, 20) }}"